function [path,t]=polypath(state0,state1,tspan,Ts)
%% 参数定义
t0=tspan(1);%换道起始时间
t1=tspan(2);%换道终止时间
order=size(state0,1)*2-1;
%% 五次多项式轨迹生成
%计算A和B两个系数矩阵
X=[state0(:,1);state1(:,1)];
Y=[state0(:,2);state1(:,2)];
if order==5
T=[...
    t0^5     t0^4     t0^3     t0^2     t0      1;
    5*t0^4   4*t0^3   3*t0^2   2*t0     1       0;
    20*t0^3  12*t0^2  6*t0     2        0       0;
    t1^5     t1^4     t1^3     t1^2     t1      1;
    5*t1^4   4*t1^3   3*t1^2   2*t1     1       0;
    20*t1^3  12*t1^2  6*t1     2        0       0;
    ];
elseif order ==3
T=[...
    t0^3     t0^2     t0      1;
    3*t0^2   2*t0     1       0;
    t1^3     t1^2     t1      1;
    3*t1^2   2*t1     1       0;
    ];
elseif order ==7
T=[...
    t0^7     t0^6     t0^5     t0^4     t0^3     t0^2     t0      1;
    7*t0^6   6*t0^5   5*t0^4   4*t0^3   3*t0^2   2*t0     1       0;
    42*t0^5  30*t0^4  20*t0^3  12*t0^2  6*t0     2        0       0;
    210*t0^4 120*t0^3 60*t0^2  24*t0    6        0        0       0;  
    t1^7     t1^6     t1^5     t1^4     t1^3     t1^2     t1      1;
    7*t1^6   6*t1^5   5*t1^4   4*t1^3   3*t1^2   2*t1     1       0;
    42*t1^5  30*t1^4  20*t1^3  12*t1^2  6*t1     2        0       0;
    210*t1^4 120*t1^3 60*t1^2  24*t1    6        0        0       0;
    ];
end
    
A= T \ X;
B= T \ Y;

%将时间从t0到t1离散化，获得离散时刻的轨迹坐标
t=(t0:Ts:t1)';
path=zeros(length(t),order+1); %1-6列分别存放x,y,vx,vy,ax,ay

if order ==5
for i=1:length(t)
   %横向位置坐标
   path(i,1)=[t(i)^5,t(i)^4,t(i)^3,t(i)^2,t(i),1]*A;
   %纵向位置坐标
   path(i,2)=[t(i)^5,t(i)^4,t(i)^3,t(i)^2,t(i),1]*B;
   %横向速度
   path(i,3)=[5*t(i)^4,4*t(i)^3,3*t(i)^2,2*t(i),1,0]*A;
   %纵向速度
   path(i,4)=[5*t(i)^4,4*t(i)^3,3*t(i)^2,2*t(i),1,0]*B;
   %横向加速度
   path(i,5)=[20*t(i)^3,12*t(i)^2,6*t(i),2,0,0]*A;
   %纵向加速度
   path(i,6)=[20*t(i)^3,12*t(i)^2,6*t(i),2,0,0]*B;
   
end
elseif order==3
for i=1:length(t)
   %横向位置坐标
   path(i,1)=[t(i)^3,t(i)^2,t(i),1]*A;
   %纵向位置坐标
   path(i,2)=[t(i)^3,t(i)^2,t(i),1]*B;
   %横向速度
   path(i,3)=[3*t(i)^2,2*t(i),1,0]*A;
   %纵向速度
   path(i,4)=[3*t(i)^2,2*t(i),1,0]*B;
   
end
elseif order ==7
    for i=1:length(t)
       %横向位置坐标
       path(i,1)=[t(i)^7,t(i)^6,t(i)^5,t(i)^4,t(i)^3,t(i)^2,t(i),1]*A;
       %纵向位置坐标
       path(i,2)=[t(i)^7,t(i)^6,t(i)^5,t(i)^4,t(i)^3,t(i)^2,t(i),1]*B;
       %横向速度
       path(i,3)=[7*t(i)^6,6*t(i)^5,5*t(i)^4,4*t(i)^3,3*t(i)^2,2*t(i),1,0]*A;
       %纵向速度
       path(i,4)=[7*t(i)^6,6*t(i)^5,5*t(i)^4,4*t(i)^3,3*t(i)^2,2*t(i),1,0]*B;
       %横向加速度
       path(i,5)=[42*t(i)^5,30*t(i)^4,20*t(i)^3,12*t(i)^2,6*t(i),2,0,0]*A;
       %纵向加速度
       path(i,6)=[42*t(i)^5,30*t(i)^4,20*t(i)^3,12*t(i)^2,6*t(i),2,0,0]*B;
       %横向加加速度
       path(i,7)=[210*t(i)^4,120*t(i)^3,60*t(i)^2,24*t(i),6,0,0,0]*A;
       %纵向加加速度
       path(i,8)=[210*t(i)^4,120*t(i)^3,60*t(i)^2,24*t(i),6,0,0,0]*B;
    end
end


end